Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
/*
 * CanFD2040.cpp
 *
 *  Created on: 22 Aug 2022
 *      Author: David
 */

#include "CanFD2040.h"

#define PICO_MUTEX_ENABLE_SDK120_COMPATIBILITY	0	// used by mutex.h which is included by multicore.h
#include "hardware/regs/dreq.h" // DREQ_PIO0_RX1
#include "hardware/structs/dma.h" // dma_hw
#include "hardware/structs/iobank0.h" // iobank0_hw
#include "hardware/structs/padsbank0.h" // padsbank0_hw
#include "hardware/structs/resets.h" // RESETS_RESET_PIO0_BITS
#include <pico/multicore.h>
#include <RP2040.h>

#include <cstring>

extern "C" void debugPrintf(const char *fmt, ...) noexcept;

extern "C" void PIO_isr() noexcept;

/****************************************************************
 * rp2040 and low-level helper functions
 ****************************************************************/

// Helper compiler definitions
#define barrier() __asm__ __volatile__("": : :"memory")
#define likely(x)       __builtin_expect(!!(x), 1)
#define unlikely(x)     __builtin_expect(!!(x), 0)
#define DIV_ROUND_UP(n,d) (((n) + (d) - 1) / (d))

#pragma GCC optimize ("O3")

// rp2040 helper function to clear a hardware reset bit
static void rp2040_clear_reset(uint32_t reset_bit)
{
    if (resets_hw->reset & reset_bit)
    {
        hw_clear_bits(&resets_hw->reset, reset_bit);
        while (!(resets_hw->reset_done & reset_bit)) { }
    }
}

/****************************************************************
 * rp2040 PIO support
 ****************************************************************/

#define PIO_CLOCK_PER_BIT 32

#define can2040_offset_sync_found_end_of_message 2u
#define can2040_offset_sync_signal_start 4u
#define can2040_offset_sync_entry 6u
#define can2040_offset_sync_end 13u
#define can2040_offset_shared_rx_read 13u
#define can2040_offset_shared_rx_end 15u
#define can2040_offset_match_load_next 18u
#define can2040_offset_match_end 25u
#define can2040_offset_tx_got_recessive 25u
#define can2040_offset_tx_start 26u
#define can2040_offset_tx_conflict 31u

static const uint16_t can2040_program_instructions[] = {
    0x0085, //  0: jmp    y--, 5
    0x0048, //  1: jmp    x--, 8
    0xe13a, //  2: set    x, 26                  [1]
    0x00cc, //  3: jmp    pin, 12
    0xc000, //  4: irq    nowait 0
    0x00c0, //  5: jmp    pin, 0
    0xc040, //  6: irq    clear 0
    0xe228, //  7: set    x, 8                   [2]
    0xf242, //  8: set    y, 2                   [18]
    0xc104, //  9: irq    nowait 4               [1]
    0x03c5, // 10: jmp    pin, 5                 [3]
    0x0307, // 11: jmp    7                      [3]
    0x0043, // 12: jmp    x--, 3
    0x20c4, // 13: wait   1 irq, 4
    0x4001, // 14: in     pins, 1
    0xa046, // 15: mov    y, isr
    0x00b2, // 16: jmp    x != y, 18
    0xc002, // 17: irq    nowait 2
    0x40eb, // 18: in     osr, 11
    0x4054, // 19: in     y, 20
    0xa047, // 20: mov    y, osr
    0x8080, // 21: pull   noblock
    0xa027, // 22: mov    x, osr
    0x0098, // 23: jmp    y--, 24
    0xa0e2, // 24: mov    osr, y
    0xa242, // 25: nop                           [2]
    0x6021, // 26: out    x, 1
    0xa001, // 27: mov    pins, x
    0x20c4, // 28: wait   1 irq, 4
    0x00d9, // 29: jmp    pin, 25
    0x023a, // 30: jmp    !x, 26                 [2]
    0xc027, // 31: irq    wait 7
};

// 3-bit Gray code table, shifted left 1 bit with lower even parity bit added
constexpr uint8_t GrayTable[] = { 0b0000, 0b0011, 0b0110, 0b0101, 0b1100, 0b1111, 0b1010, 0b1001 };

/****************************************************************
 * CRC calculation
 ****************************************************************/

static constexpr uint32_t crc17Table[] =
{
	0x00000000, 0xB42D8000, 0xDC768000, 0x685B0000, 0x0CC08000, 0xB8ED0000, 0xD0B60000, 0x649B8000,
	0x19810000, 0xADAC8000, 0xC5F78000, 0x71DA0000, 0x15418000, 0xA16C0000, 0xC9370000, 0x7D1A8000,
	0x33020000, 0x872F8000, 0xEF748000, 0x5B590000, 0x3FC28000, 0x8BEF0000, 0xE3B40000, 0x57998000,
	0x2A830000, 0x9EAE8000, 0xF6F58000, 0x42D80000, 0x26438000, 0x926E0000, 0xFA350000, 0x4E188000,
	0x66040000, 0xD2298000, 0xBA728000, 0x0E5F0000, 0x6AC48000, 0xDEE90000, 0xB6B20000, 0x029F8000,
	0x7F850000, 0xCBA88000, 0xA3F38000, 0x17DE0000, 0x73458000, 0xC7680000, 0xAF330000, 0x1B1E8000,
	0x55060000, 0xE12B8000, 0x89708000, 0x3D5D0000, 0x59C68000, 0xEDEB0000, 0x85B00000, 0x319D8000,
	0x4C870000, 0xF8AA8000, 0x90F18000, 0x24DC0000, 0x40478000, 0xF46A0000, 0x9C310000, 0x281C8000,
	0xCC080000, 0x78258000, 0x107E8000, 0xA4530000, 0xC0C88000, 0x74E50000, 0x1CBE0000, 0xA8938000,
	0xD5890000, 0x61A48000, 0x09FF8000, 0xBDD20000, 0xD9498000, 0x6D640000, 0x053F0000, 0xB1128000,
	0xFF0A0000, 0x4B278000, 0x237C8000, 0x97510000, 0xF3CA8000, 0x47E70000, 0x2FBC0000, 0x9B918000,
	0xE68B0000, 0x52A68000, 0x3AFD8000, 0x8ED00000, 0xEA4B8000, 0x5E660000, 0x363D0000, 0x82108000,
	0xAA0C0000, 0x1E218000, 0x767A8000, 0xC2570000, 0xA6CC8000, 0x12E10000, 0x7ABA0000, 0xCE978000,
	0xB38D0000, 0x07A08000, 0x6FFB8000, 0xDBD60000, 0xBF4D8000, 0x0B600000, 0x633B0000, 0xD7168000,
	0x990E0000, 0x2D238000, 0x45788000, 0xF1550000, 0x95CE8000, 0x21E30000, 0x49B80000, 0xFD958000,
	0x808F0000, 0x34A28000, 0x5CF98000, 0xE8D40000, 0x8C4F8000, 0x38620000, 0x50390000, 0xE4148000,
	0x2C3D8000, 0x98100000, 0xF04B0000, 0x44668000, 0x20FD0000, 0x94D08000, 0xFC8B8000, 0x48A60000,
	0x35BC8000, 0x81910000, 0xE9CA0000, 0x5DE78000, 0x397C0000, 0x8D518000, 0xE50A8000, 0x51270000,
	0x1F3F8000, 0xAB120000, 0xC3490000, 0x77648000, 0x13FF0000, 0xA7D28000, 0xCF898000, 0x7BA40000,
	0x06BE8000, 0xB2930000, 0xDAC80000, 0x6EE58000, 0x0A7E0000, 0xBE538000, 0xD6088000, 0x62250000,
	0x4A398000, 0xFE140000, 0x964F0000, 0x22628000, 0x46F90000, 0xF2D48000, 0x9A8F8000, 0x2EA20000,
	0x53B88000, 0xE7950000, 0x8FCE0000, 0x3BE38000, 0x5F780000, 0xEB558000, 0x830E8000, 0x37230000,
	0x793B8000, 0xCD160000, 0xA54D0000, 0x11608000, 0x75FB0000, 0xC1D68000, 0xA98D8000, 0x1DA00000,
	0x60BA8000, 0xD4970000, 0xBCCC0000, 0x08E18000, 0x6C7A0000, 0xD8578000, 0xB00C8000, 0x04210000,
	0xE0358000, 0x54180000, 0x3C430000, 0x886E8000, 0xECF50000, 0x58D88000, 0x30838000, 0x84AE0000,
	0xF9B48000, 0x4D990000, 0x25C20000, 0x91EF8000, 0xF5740000, 0x41598000, 0x29028000, 0x9D2F0000,
	0xD3378000, 0x671A0000, 0x0F410000, 0xBB6C8000, 0xDFF70000, 0x6BDA8000, 0x03818000, 0xB7AC0000,
	0xCAB68000, 0x7E9B0000, 0x16C00000, 0xA2ED8000, 0xC6760000, 0x725B8000, 0x1A008000, 0xAE2D0000,
	0x86318000, 0x321C0000, 0x5A470000, 0xEE6A8000, 0x8AF10000, 0x3EDC8000, 0x56878000, 0xE2AA0000,
	0x9FB08000, 0x2B9D0000, 0x43C60000, 0xF7EB8000, 0x93700000, 0x275D8000, 0x4F068000, 0xFB2B0000,
	0xB5338000, 0x011E0000, 0x69450000, 0xDD688000, 0xB9F30000, 0x0DDE8000, 0x65858000, 0xD1A80000,
	0xACB28000, 0x189F0000, 0x70C40000, 0xC4E98000, 0xA0720000, 0x145F8000, 0x7C048000, 0xC8290000
};

static constexpr uint32_t crc21Table[] =
{
	0x00000000, 0x8144C800, 0x83CD5800, 0x02899000, 0x86DE7800, 0x079AB000, 0x05132000, 0x8457E800,
	0x8CF83800, 0x0DBCF000, 0x0F356000, 0x8E71A800, 0x0A264000, 0x8B628800, 0x89EB1800, 0x08AFD000,
	0x98B4B800, 0x19F07000, 0x1B79E000, 0x9A3D2800, 0x1E6AC000, 0x9F2E0800, 0x9DA79800, 0x1CE35000,
	0x144C8000, 0x95084800, 0x9781D800, 0x16C51000, 0x9292F800, 0x13D63000, 0x115FA000, 0x901B6800,
	0xB02DB800, 0x31697000, 0x33E0E000, 0xB2A42800, 0x36F3C000, 0xB7B70800, 0xB53E9800, 0x347A5000,
	0x3CD58000, 0xBD914800, 0xBF18D800, 0x3E5C1000, 0xBA0BF800, 0x3B4F3000, 0x39C6A000, 0xB8826800,
	0x28990000, 0xA9DDC800, 0xAB545800, 0x2A109000, 0xAE477800, 0x2F03B000, 0x2D8A2000, 0xACCEE800,
	0xA4613800, 0x2525F000, 0x27AC6000, 0xA6E8A800, 0x22BF4000, 0xA3FB8800, 0xA1721800, 0x2036D000,
	0xE11FB800, 0x605B7000, 0x62D2E000, 0xE3962800, 0x67C1C000, 0xE6850800, 0xE40C9800, 0x65485000,
	0x6DE78000, 0xECA34800, 0xEE2AD800, 0x6F6E1000, 0xEB39F800, 0x6A7D3000, 0x68F4A000, 0xE9B06800,
	0x79AB0000, 0xF8EFC800, 0xFA665800, 0x7B229000, 0xFF757800, 0x7E31B000, 0x7CB82000, 0xFDFCE800,
	0xF5533800, 0x7417F000, 0x769E6000, 0xF7DAA800, 0x738D4000, 0xF2C98800, 0xF0401800, 0x7104D000,
	0x51320000, 0xD076C800, 0xD2FF5800, 0x53BB9000, 0xD7EC7800, 0x56A8B000, 0x54212000, 0xD565E800,
	0xDDCA3800, 0x5C8EF000, 0x5E076000, 0xDF43A800, 0x5B144000, 0xDA508800, 0xD8D91800, 0x599DD000,
	0xC986B800, 0x48C27000, 0x4A4BE000, 0xCB0F2800, 0x4F58C000, 0xCE1C0800, 0xCC959800, 0x4DD15000,
	0x457E8000, 0xC43A4800, 0xC6B3D800, 0x47F71000, 0xC3A0F800, 0x42E43000, 0x406DA000, 0xC1296800,
	0x437BB800, 0xC23F7000, 0xC0B6E000, 0x41F22800, 0xC5A5C000, 0x44E10800, 0x46689800, 0xC72C5000,
	0xCF838000, 0x4EC74800, 0x4C4ED800, 0xCD0A1000, 0x495DF800, 0xC8193000, 0xCA90A000, 0x4BD46800,
	0xDBCF0000, 0x5A8BC800, 0x58025800, 0xD9469000, 0x5D117800, 0xDC55B000, 0xDEDC2000, 0x5F98E800,
	0x57373800, 0xD673F000, 0xD4FA6000, 0x55BEA800, 0xD1E94000, 0x50AD8800, 0x52241800, 0xD360D000,
	0xF3560000, 0x7212C800, 0x709B5800, 0xF1DF9000, 0x75887800, 0xF4CCB000, 0xF6452000, 0x7701E800,
	0x7FAE3800, 0xFEEAF000, 0xFC636000, 0x7D27A800, 0xF9704000, 0x78348800, 0x7ABD1800, 0xFBF9D000,
	0x6BE2B800, 0xEAA67000, 0xE82FE000, 0x696B2800, 0xED3CC000, 0x6C780800, 0x6EF19800, 0xEFB55000,
	0xE71A8000, 0x665E4800, 0x64D7D800, 0xE5931000, 0x61C4F800, 0xE0803000, 0xE209A000, 0x634D6800,
	0xA2640000, 0x2320C800, 0x21A95800, 0xA0ED9000, 0x24BA7800, 0xA5FEB000, 0xA7772000, 0x2633E800,
	0x2E9C3800, 0xAFD8F000, 0xAD516000, 0x2C15A800, 0xA8424000, 0x29068800, 0x2B8F1800, 0xAACBD000,
	0x3AD0B800, 0xBB947000, 0xB91DE000, 0x38592800, 0xBC0EC000, 0x3D4A0800, 0x3FC39800, 0xBE875000,
	0xB6288000, 0x376C4800, 0x35E5D800, 0xB4A11000, 0x30F6F800, 0xB1B23000, 0xB33BA000, 0x327F6800,
	0x1249B800, 0x930D7000, 0x9184E000, 0x10C02800, 0x9497C000, 0x15D30800, 0x175A9800, 0x961E5000,
	0x9EB18000, 0x1FF54800, 0x1D7CD800, 0x9C381000, 0x186FF800, 0x992B3000, 0x9BA2A000, 0x1AE66800,
	0x8AFD0000, 0x0BB9C800, 0x09305800, 0x88749000, 0x0C237800, 0x8D67B000, 0x8FEE2000, 0x0EAAE800,
	0x06053800, 0x8741F000, 0x85C86000, 0x048CA800, 0x80DB4000, 0x019F8800, 0x03161800, 0x8252D000
};

// CRC polynomials used, including the MSB
constexpr uint32_t crc17polynomial = 0x0003685B;	// 0b0000'0000'0000'0011'0110'1000'0101'0011 including the leading 1
constexpr uint32_t crc17initialValue = 1u << 31;	// initial value after left shifting
constexpr uint32_t crc21polynomial = 0x00302899; 	// 0b0000'0000'0011'0000'0010'1000'1001'1001;
constexpr uint32_t crc21initialValue = 1u << 31;	// initial value after left shifting

// Calculate CRC17 on a number of bits between 1 and 31 (must not be called with 0 bits!). The bits are left-justified and any lower-order bits are zero.
uint32_t Crc17Bits(uint32_t remainder, uint32_t data, unsigned int numBits) noexcept
{
	remainder ^= data;
	do
	{
		--numBits;
        const uint32_t mask = (remainder & 0x8000'0000) ? 0xFFFFFFFF : 0;
        remainder = (remainder << 1) ^ (mask & (crc17polynomial << (32 - 17)));
	} while (numBits != 0);
	return remainder;
}

// Calculate CRC17 on a number of 32-bit words
uint32_t Crc17Words(const uint32_t *buf, unsigned int numWords) noexcept
{
	uint32_t r17 = crc17initialValue;
	while (numWords != 0)
	{
		--numWords;
		uint32_t data = *buf++;
		r17 = (r17 << 8) ^ crc17Table[(r17 ^ data) >> 24];
		data <<= 8;
		r17 = (r17 << 8) ^ crc17Table[(r17 ^ data) >> 24];
		data <<= 8;
		r17 = (r17 << 8) ^ crc17Table[(r17 ^ data) >> 24];
		data <<= 8;
		r17 = (r17 << 8) ^ crc17Table[(r17 ^ data) >> 24];
	}
	return r17;
}

