Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Calculate CRC21 on a number of bits between 1 and 31. (must not be called with 0 bits!). The bits are left-justified and any lower-order bits are zero.
uint32_t Crc21Bits(uint32_t remainder, uint32_t data, unsigned int numBits) noexcept
{
	remainder ^= data;
	do
	{
		--numBits;
        const uint32_t mask = (remainder & 0x8000'0000) ? 0xFFFFFFFF : 0;
        remainder = (remainder << 1) ^ (mask & (crc21polynomial << (32 - 21)));
	} while (numBits != 0);
	return remainder;
}

// Calculate CRC21 on a number of words
uint32_t Crc21Words(const uint32_t *buf, unsigned int numWords) noexcept
{
	uint32_t r21 = crc21initialValue;
	while (numWords != 0)
	{
		--numWords;
		uint32_t data = *buf++;
		r21 = (r21 << 8) ^ crc21Table[(r21 ^ data) >> 24];
		data <<= 8;
		r21 = (r21 << 8) ^ crc21Table[(r21 ^ data) >> 24];
		data <<= 8;
		r21 = (r21 << 8) ^ crc21Table[(r21 ^ data) >> 24];
		data <<= 8;
		r21 = (r21 << 8) ^ crc21Table[(r21 ^ data) >> 24];
	}
	return r21;
}

/****************************************************************
 * Bit unstuffing
 ****************************************************************/

// Update the CRCs with between 1 and 32 bits (0 is not allowed). The data is right-justified and any higher bits in it are ignored.
void BitUnstuffer::AddCrcBits(uint32_t data, unsigned int numBits) noexcept
{
#if 1
	uint32_t leftJustifiedData = data << (32 - numBits);
	uint32_t r17 = crc17;
	uint32_t r21 = crc21;

	// Use table driven byte-at-a-time CRC for the first 8n bits
	while (numBits >= 8)
	{
		numBits -= 8;
		r17 = (r17 << 8) ^ crc17Table[(r17 ^ leftJustifiedData) >> 24];
		r21 = (r21 << 8) ^ crc21Table[(r21 ^ leftJustifiedData) >> 24];
		leftJustifiedData <<= 8;
	}
	if (numBits != 0)
	{
		// Use bit-at-a-time CRC for the remaining bits
		//TODO save unused bits to incorporate later, then just use bit-at-a-time when we need the final CRC (take care when adding 32 bits!)
		r17 ^= leftJustifiedData;
		r21 ^= leftJustifiedData;
		do
		{
			--numBits;
			// This code compiles the loop body to fewer instructions than using an if-statement does, and saves a conditional jump
			const uint32_t mask17 = (r17 & 0x8000'0000) ? 0xFFFFFFFF : 0;
			r17 = (r17 << 1) ^ (mask17 & (crc17polynomial << (32 - 17)));
			const uint32_t mask21 = (r21 & 0x8000'0000) ? 0xFFFFFFFF : 0;
			r21 = (r21 << 1) ^ (mask21 & (crc21polynomial << (32 - 21)));
		} while (numBits != 0);
	}
#else
	// Bit-at-a-time algorithm
	const uint32_t leftJustifiedData = data << (32 - numBits);
	uint32_t r17 = crc17 ^ leftJustifiedData;
	uint32_t r21 = crc21 ^ leftJustifiedData;
	do
	{
		--numBits;
		// This code compiles the loop body to fewer instructions than using an if-statement does, and saves a conditional jump
        const uint32_t mask17 = (r17 & 0x8000'0000) ? 0xFFFFFFFF : 0;
        r17 = (r17 << 1) ^ (mask17 & (crc17polynomial << (32 - 17)));
        const uint32_t mask21 = (r21 & 0x8000'0000) ? 0xFFFFFFFF : 0;
        r21 = (r21 << 1) ^ (mask21 & (crc21polynomial << (32 - 21)));
	} while (numBits != 0);
#endif
	crc17 = r17;
	crc21 = r21;
}

// Initialise the CRCs with 0 to 32 bits of data
inline void BitUnstuffer::InitCrc(uint32_t data, unsigned int numBits) noexcept
{
	crc17 = crc21 = 1u << 31;							// both CRCs start with 1 in the MSB
	if (numBits != 0)
	{
		AddCrcBits(data, numBits);
	}
}

// Add 'count' number of bits from 'data' to the unstuffer
// The bits are shifted left into stuffed_bits, and count_stuff is set to the number of bits added
void BitUnstuffer::AddBits(uint32_t data, uint32_t count) noexcept
{
    const uint32_t mask = (1u << count) - 1;
    stuffed_bits = (stuffed_bits << count) | (data & mask);
    stuffedBitsAvailable = count;
}

// Reset state and set the next desired 'count' unstuffed bits to extract
void BitUnstuffer::SetCount(uint32_t count) noexcept
{
    unstuffed_bits = 0;
    unstuffedBitsWanted = count;
}

// Update the stuffed bits history so that it looks like we had just one recessive bit before any remaining unprocessed bits
void BitUnstuffer::ClearState() noexcept
{
	const uint32_t prevBit = 1u << stuffedBitsAvailable;
	stuffed_bits = (stuffed_bits & (prevBit - 1u)) | prevBit;
}

// Pull bits from unstuffer (as specified in unstuf_set_count())
// Return 0 if successful, 1 if need more data, -1 if six recessive bits detected, or -2 if 6 dominant bits detected
int BitUnstuffer::PullBits() noexcept
{
    const uint32_t sb = stuffed_bits;
	uint32_t cs = stuffedBitsAvailable;
	uint32_t cu = unstuffedBitsWanted;

	switch (stuffType)
	{
	case StuffingType::none:		// receiving ACK or EOF, so using no stuff bits
	default:
		{
			const uint32_t toExtract = min<uint32_t>(cu, cs);
			unstuffed_bits = (unstuffed_bits << toExtract)
							| ((stuffed_bits >> (cs - toExtract)) & ((1u << toExtract) - 1u));
			cs -= toExtract;
			cu -= toExtract;
			stuffedBitsAvailable = cs;
			unstuffedBitsWanted = cu;
			return (cu == 0) ? 0 : 1;
		}

	case StuffingType::fixed:		// receiving stuff count or CRC, so using fixed stuff bits
		{
			// When using fixed stuff bits we do not update the CRC
			uint32_t bu = bitsUntilFixedStuffBit;
			while (cu != 0 && cs != 0)
			{
				if (bu == 0)
				{
					// Check that this is the inverse of the previous bit
					if (unlikely(((sb ^ (sb >> 1)) & (1u << (cs - 1))) == 0))
					{
						return ((sb >> cs) & 1u) ? -1 : -2;
					}
					--cs;
					bu = 4;
					if (cs == 0)
					{
						break;
					}
				}
				const uint32_t toExtract = min<uint32_t>(cu, min<uint32_t>(cs, bu));
				unstuffed_bits = (unstuffed_bits << toExtract)
								| ((stuffed_bits >> (cs - toExtract)) & ((1u << toExtract) - 1u));
				cs -= toExtract;
				cu -= toExtract;
				bu -= toExtract;
			}
			stuffedBitsAvailable = cs;
			unstuffedBitsWanted = cu;
			bitsUntilFixedStuffBit = bu;
			return (cu == 0) ? 0 : 1;
		}

	case StuffingType::dynamic:		// receiving header or data, so using variable stuff bits. In CAN-FD the stuff bits are included in the CRC.
		{
			if (cs == 0)
			{
				// Need more data
				return 1;
			}

			const uint32_t edges = sb ^ (sb >> 1);
			const uint32_t e2 = edges | (edges >> 1);
			const uint32_t e4 = e2 | (e2 >> 2);
			const uint32_t rm_bits = ~e4;

			while (true)
			{
				uint32_t try_cnt = cs > cu ? cu : cs;
				for (;;)
				{
					// Try_cnt may be zero here, but we must not call the CRC functions with 0 bits of data
					if (likely(try_cnt != 0))
					{
						const uint32_t try_mask = ((1 << try_cnt) - 1) << (cs + 1 - try_cnt);
						if (likely((rm_bits & try_mask) == 0))
						{
							// No stuff bits in try_cnt bits - copy into unstuffed_bits
							unstuffedBitsWanted = cu = cu - try_cnt;
							stuffedBitsAvailable = cs = cs - try_cnt;
							unstuffed_bits |= ((sb >> cs) & ((1u << try_cnt) - 1)) << cu;
							AddCrcBits(sb >> cs, try_cnt);
							if (cu == 0)
							{
								// Extracted desired bits
								return 0;
							}
							break;
						}
					}

