Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
					// There must be at least 1 more bit available
					stuffedBitsAvailable = cs = cs - 1;
					AddCrcBits(sb >> cs, 1);
					if (rm_bits & (1u << (cs + 1)))
					{
						// High bit of try_cnt a stuff bit
						++totalStuffBits;
						if (unlikely(rm_bits & (1u << cs)))
						{
							// Six consecutive bits - a bitstuff error
							return ((sb >> cs) & 1u) ? -1 : -2;
						}
						break;
					}
					// High bit not a stuff bit. Copy 1 bit over, limit try_cnt, and retry
					unstuffedBitsWanted = cu = cu - 1;
					unstuffed_bits |= ((sb >> cs) & 1) << cu;
					try_cnt /= 2;
				}
				if (likely(cs == 0))
				{
					// Need more data
					return 1;
				}
			}
		}
	}
}

/****************************************************************
 * Bit stuffing
 ****************************************************************/

// State storage for building bit stuffed transmit messages
class BitStuffer
{
public:
	BitStuffer(uint32_t *p_buf) noexcept : prev_stuffed(1), bitpos(0), totalStuffBits(0), buf(p_buf) { }
	void pushraw(uint32_t data, uint32_t count) noexcept;
	void push(uint32_t data, uint32_t count) noexcept;
	void AddFixedStuffBit() noexcept;
	uint32_t finalize() noexcept;
	uint32_t stuff(uint32_t& pb, uint32_t num_bits) noexcept;
	uint32_t GetTotalStuffBits() const noexcept { return totalStuffBits; }
	uint32_t GetTotalBits() const noexcept { return bitpos; }

private:
    uint32_t prev_stuffed;		// the previous 5 (or more) bits we have stored in the buffer, so we can tell whether stuffing is needed when we store more bits
    uint32_t bitpos;			// how many bits we have stored in the buffer already
    uint32_t totalStuffBits;
    uint32_t lastData;			// the last bit stored, used when adding fixed stuff bits
    uint32_t *buf;				// the buffer we are stuffing into
};

// Push 'count' bits of 'data' into stuffer without performing bit stuffing
void BitStuffer::pushraw(uint32_t data, uint32_t count) noexcept
pre(count <= 32)
{
	lastData = data;									// assume we are never asked to push 0 bits
    const uint32_t wp = bitpos / 32;					// current index into the buffer
    const uint32_t bitavail = 32 - (bitpos % 32);		// number of bits available in the word at the current index, 1 to 32
    if (bitavail == 32)
    {
    	buf[wp] = data << (32 - count);
    }
    else if (bitavail >= count)
    {
    	buf[wp] |= data << (bitavail - count);
    }
    else
    {
    	buf[wp] |= data >> (count - bitavail);
    	buf[wp + 1] = data << (32 - (count - bitavail));
    }
    bitpos += count;
}

// Push 'count' (max 26) bits of 'data' into stuffer
void BitStuffer::push(uint32_t data, uint32_t count) noexcept
pre(count <= 26)										// the stuffer may expand 26 bits to 32
{
    data &= (1 << count) - 1;							// clear the high bits
    uint32_t stuf = (prev_stuffed << count) | data;
    const uint32_t newcount = stuff(stuf, count);
    pushraw(stuf, newcount);
    prev_stuffed = stuf;
}

// Pad final word of stuffer with high bits
uint32_t BitStuffer::finalize() noexcept
{
    const uint32_t words = DIV_ROUND_UP(bitpos, 32);
    const uint32_t extra = words * 32 - bitpos;
    if (extra)
    {
        buf[words - 1] |= (1 << extra) - 1;
    }
    return words;
}

// Add a fixed stuff bit, not included in the count of total stuff bits
void BitStuffer::AddFixedStuffBit() noexcept
{
	pushraw((~lastData) & 1u, 1);
}

// Stuff 'num_bits' (max 26) bits in 'pb' - upper bits must already be stuffed. Return the count of bits generated.
uint32_t BitStuffer::stuff(uint32_t& pb, uint32_t num_bits) noexcept
pre(count <= 26)
{
    uint32_t b = pb;
    uint32_t count = num_bits;
    for (;;)
    {
        uint32_t try_cnt = num_bits;
        const uint32_t edges = b ^ (b >> 1);
        const uint32_t e2 = edges | (edges >> 1), e4 = e2 | (e2 >> 2);
        const uint32_t add_bits = ~e4;
        for (;;)
        {
            const uint32_t try_mask = ((1 << try_cnt) - 1) << (num_bits - try_cnt);
            if (!(add_bits & try_mask))
            {
                // No stuff bits needed in try_cnt bits
                if (try_cnt >= num_bits) { goto done; }
                num_bits -= try_cnt;
                try_cnt = (num_bits + 1) / 2;
            }
            else
            {
				if (add_bits & (1 << (num_bits - 1)))
				{
					// A stuff bit must be inserted prior to the high bit
					const uint32_t low_mask = (1 << num_bits) - 1, low = b & low_mask;
					const uint32_t high = (b & ~(low_mask >> 1)) << 1;
					b = high ^ low ^ (1 << (num_bits - 1));
					++count;
					++totalStuffBits;
					if (num_bits <= 4) { goto done; }
					num_bits -= 4;
					break;
				}
				// High bit doesn't need stuff bit - accept it, limit try_cnt, retry
				num_bits--;
				try_cnt /= 2;
            }
        }
    }
done:
    pb = b;
    return count;
}

// CanFD2040 members
// Start CAN-FD running
void CanFD2040::Entry(VirtualCanRegisters *p_regs) noexcept
{
	regs = p_regs;
    for (;;)
    {
    	// Disable CAN - set output to recessive
    	pinMode(regs->txPin, OUTPUT_HIGH);

    	// Wait for the signal to enable CAN
    	while (!regs->canEnabled) { }

    	pendingIrqs = 0;
    	txStuffedWords = 0;
    	tx_state = TS_IDLE;
    	pio_setup();										// Set up the PIO and pins
        data_state_go_discard();
        __enable_irq();

    	while (regs->canEnabled)
    	{
    		// If we were asked to clear the error counts, do it
    		if (regs->clearErrorCounts)
    		{
    			regs->clearErrorCounts = false;
    			regs->errors.Clear();
    		}

    		// If we have no pending transmission populate the transmit buffer from the next element in the transmit fifo
    		if (txStuffedWords == 0)
    		{
    			TryPopulateTransmitBuffer();
    		}

    		// If there are any pending interrupt flags, send them to the other processor
   			if (pendingIrqs != 0 && (sio_hw->fifo_st & SIO_FIFO_ST_RDY_BITS) != 0)
   			{
   				__disable_irq();
   				sio_hw->fifo_wr = pendingIrqs;
   				pendingIrqs = 0;
    			__sev();
  				__enable_irq();
   			}
    	}
    	__disable_irq();
    }
}

// Set up a message ready to be transmitted
void CanFD2040::TryPopulateTransmitBuffer() noexcept
{
	VirtualCanRegisters::TxFifo& fifo = regs->txFifo;
	uint32_t getIndex = fifo.getIndex;
	if (getIndex != fifo.putIndex)
	{
		const volatile CanTxBuffer *const txBuf = &regs->txFifo.buffers[getIndex];
		txId = txBuf->T0.bit.ID;
		txDlc = txBuf->T1.bit.DLC;

		// Push the header through the stuffer
		BitStuffer bs(txMessage);
		if (txBuf->T0.bit.XTD)
		{
			// Extended header. The maximum number of bits we can push in a single operation is 26 to allow for up to 6 stuff bits.
			const uint32_t h1 = ((txId & 0x1ffc0000) >> 16) | 0x03;
			const uint32_t h2 = txId & 0x3ffff;
			const uint32_t h3 = 0x80 | txDlc;
			bs.push(h1, 14);				// SOF + 11 bits of ID + RRS + ID
			bs.push(h2, 18);				// 18 bits of ID
			bs.push(h3, 9);					// RRS + 8 bits starting at FDF
		}
		else
		{
			// Standard header
			const uint32_t hdr = ((txId & 0x7ff) << 10) | 0x80 | txDlc;
			bs.push(hdr, 22);				// SOF + 11 bits of ID + RRS + IDE + 8 bytes starting at FDF
		}

		// Push the data
		if (txDlc < 8)
		{
			for (size_t i = 0; i < txDlc; i++)
			{
				bs.push(txBuf->data8[i], 8);
			}
		}
		else
		{
			if (txDlc <= 12)
			{
				for (size_t i = 0; i < 2 * (txDlc - 6); i++)
				{
					bs.push(txBuf->data16[i], 16);
				}
			}
			else
			{
				for (size_t i = 0; i < 8 * (txDlc - 11); i++)
				{
					bs.push(txBuf->data16[i], 16);
				}
			}
		}

		// Push the stuff count. The CRC does not include the fixed stuff bits, so get the CRC up to now first.
		const size_t numWords = bs.GetTotalBits() / 32;
		const unsigned int numBits = bs.GetTotalBits() % 32;
		uint32_t tempCrc;
		if (txDlc > 10)
		{
			tempCrc = Crc21Words(txMessage, numWords);
			if (numBits != 0)
			{
				tempCrc = Crc21Bits(tempCrc, txMessage[numWords], numBits);
			}
		}
		else
		{
			tempCrc = Crc17Words(txMessage, numWords);
			if (numBits != 0)
			{
				tempCrc = Crc17Bits(tempCrc, txMessage[numWords], numBits);
			}
		}

