Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
		const uint8_t encodedStuffBits = GrayTable[bs.GetTotalStuffBits() & 7];
		bs.AddFixedStuffBit();
		bs.pushraw(encodedStuffBits, 4);

		// CRC everything stored so far and store the CRC
		if (txDlc > 10)
		{
			txCrc = Crc21Bits(tempCrc, (uint32_t)encodedStuffBits << (32 - 4), 4) >> (32 - 21);
			bs.AddFixedStuffBit();
			bs.pushraw((txCrc >> 17) & 0x0f, 4);
		}
		else
		{
			txCrc = Crc17Bits(tempCrc, (uint32_t)encodedStuffBits << (32 - 4), 4) >> (32 - 17);
		}

		bs.AddFixedStuffBit();
		bs.pushraw((txCrc >> 13) & 0x0f, 4);
		bs.AddFixedStuffBit();
		bs.pushraw((txCrc >> 9) & 0x0f, 4);
		bs.AddFixedStuffBit();
		bs.pushraw((txCrc >> 5) & 0x0f, 4);
		bs.AddFixedStuffBit();
		bs.pushraw((txCrc >> 1) & 0x0f, 4);
		bs.AddFixedStuffBit();
		bs.pushraw(((txCrc & 0x01) << 1) | 0x01, 2);		// final CRC bit and CRC delimiter

		txStuffedWords = bs.finalize();

		// Wakeup if in TS_IDLE state
		pio_irq_atomic_set_maytx();

		// Now that we have copied the message to our local buffer, we can free up the fifo slot
		++getIndex;
		if (getIndex == fifo.size)
		{
			getIndex = 0;
		}
		fifo.getIndex = getIndex;

		if (regs->txFifoNotFullInterruptEnabled)
		{
			__disable_irq();
			pendingIrqs |= VirtualCanRegisters::txFifoNotFull;
			__enable_irq();
		}
	}
}

// Setup PIO "sync" state machine (state machine 0)
void CanFD2040::pio_sync_setup() noexcept
{
    struct pio_sm_hw *sm = &pio_hw->sm[0];
    sm->execctrl = (
        regs->rxPin << PIO_SM0_EXECCTRL_JMP_PIN_LSB
        | (can2040_offset_sync_end - 1) << PIO_SM0_EXECCTRL_WRAP_TOP_LSB
        | can2040_offset_sync_signal_start << PIO_SM0_EXECCTRL_WRAP_BOTTOM_LSB);
    sm->pinctrl = (
        1 << PIO_SM0_PINCTRL_SET_COUNT_LSB
        | regs->rxPin << PIO_SM0_PINCTRL_SET_BASE_LSB);
    sm->instr = 0xe080; // set pindirs, 0
    sm->pinctrl = 0;
    pio_hw->txf[0] = PIO_CLOCK_PER_BIT / 2 * 8 - 5 - 1;
    sm->instr = 0x80a0; // pull block
    sm->instr = can2040_offset_sync_entry; // jmp sync_entry
}

// Setup PIO "rx" state machine (state machine 1)
void CanFD2040::pio_rx_setup() noexcept
{
    struct pio_sm_hw *sm = &pio_hw->sm[1];
    sm->execctrl = (
        (can2040_offset_shared_rx_end - 1) << PIO_SM0_EXECCTRL_WRAP_TOP_LSB
        | can2040_offset_shared_rx_read << PIO_SM0_EXECCTRL_WRAP_BOTTOM_LSB);
    sm->pinctrl = regs->rxPin << PIO_SM0_PINCTRL_IN_BASE_LSB;
    sm->shiftctrl = 0; // flush fifo on a restart
    sm->shiftctrl = (PIO_SM0_SHIFTCTRL_FJOIN_RX_BITS
                     | 8 << PIO_SM0_SHIFTCTRL_PUSH_THRESH_LSB
                     | PIO_SM0_SHIFTCTRL_AUTOPUSH_BITS);
    sm->instr = can2040_offset_shared_rx_read; // jmp shared_rx_read
}

// Setup PIO "match" state machine (state machine 2)
void CanFD2040::pio_match_setup() noexcept
{
    struct pio_sm_hw *sm = &pio_hw->sm[2];
    sm->execctrl = (
          (can2040_offset_match_end - 1) << PIO_SM0_EXECCTRL_WRAP_TOP_LSB
        | can2040_offset_shared_rx_read << PIO_SM0_EXECCTRL_WRAP_BOTTOM_LSB);
    sm->pinctrl = regs->rxPin << PIO_SM0_PINCTRL_IN_BASE_LSB;
    sm->shiftctrl = 0;
    sm->instr = 0xe040; // set y, 0
    sm->instr = 0xa0e2; // mov osr, y
    sm->instr = 0xa02a, // mov x, !y
    sm->instr = can2040_offset_match_load_next; // jmp match_load_next
}

// Setup PIO "tx" state machine (state machine 3)
void CanFD2040::pio_tx_setup() noexcept
{
    struct pio_sm_hw *sm = &pio_hw->sm[3];
    sm->execctrl = regs->rxPin << PIO_SM0_EXECCTRL_JMP_PIN_LSB;
    sm->shiftctrl = (PIO_SM0_SHIFTCTRL_FJOIN_TX_BITS
                     | PIO_SM0_SHIFTCTRL_AUTOPULL_BITS);
    sm->pinctrl = (1 << PIO_SM0_PINCTRL_SET_COUNT_LSB
                   | 1 << PIO_SM0_PINCTRL_OUT_COUNT_LSB
                   | regs->txPin << PIO_SM0_PINCTRL_SET_BASE_LSB
                   | regs->txPin << PIO_SM0_PINCTRL_OUT_BASE_LSB);
    sm->instr = 0xe001; // set pins, 1
    sm->instr = 0xe081; // set pindirs, 1
}

// Set PIO "sync" machine to signal "may transmit" (sm irq 0) on 11 idle bits
void CanFD2040::pio_sync_normal_start_signal() noexcept
{
    uint32_t eom_idx = can2040_offset_sync_found_end_of_message;
    pio_hw->instr_mem[eom_idx] = 0xe13a; // set x, 26 [1]
}

// Set PIO "sync" machine to signal "may transmit" (sm irq 0) on 17 idle bits
void CanFD2040::pio_sync_slow_start_signal() noexcept
{
    uint32_t eom_idx = can2040_offset_sync_found_end_of_message;
    pio_hw->instr_mem[eom_idx] = 0xa127; // mov x, osr [1]
}

// Test if PIO "rx" state machine has overflowed its fifos
int CanFD2040::pio_rx_check_stall() noexcept
{
    return pio_hw->fdebug & (1 << (PIO_FDEBUG_RXSTALL_LSB + 1));
}

// Report number of bytes still pending in PIO "rx" fifo queue
int CanFD2040::pio_rx_fifo_level() noexcept
{
    return (pio_hw->flevel & PIO_FLEVEL_RX1_BITS) >> PIO_FLEVEL_RX1_LSB;
}

// Set PIO "match" state machine to raise a "matched" signal on a bit sequence
void CanFD2040::pio_match_check(uint32_t match_key) noexcept
{
    pio_hw->txf[2] = match_key;
}

// Calculate pos+bits identifier for PIO "match" state machine
/*static*/ uint32_t CanFD2040::pio_match_calc_key(uint32_t raw_bits, uint32_t rx_bit_pos) noexcept
{
    return (raw_bits & 0x1fffff) | ((-rx_bit_pos) << 21);
}

// Cancel any pending checks on PIO "match" state machine
void CanFD2040::pio_match_clear() noexcept
{
    pio_match_check(0);
}

// Flush and halt PIO "tx" state machine
void CanFD2040::pio_tx_reset() noexcept
{
    pio_hw->ctrl = ((0x07 << PIO_CTRL_SM_ENABLE_LSB)
                    | (0x08 << PIO_CTRL_SM_RESTART_LSB));
    pio_hw->irq = (1 << 2) | (1<< 3); // clear "matched" and "ack done" signals
    // Clear tx fifo
    struct pio_sm_hw *sm = &pio_hw->sm[3];
    sm->shiftctrl = 0;
    sm->shiftctrl = (PIO_SM0_SHIFTCTRL_FJOIN_TX_BITS
                     | PIO_SM0_SHIFTCTRL_AUTOPULL_BITS);
    // Must reset again after clearing fifo
    pio_hw->ctrl = ((0x07 << PIO_CTRL_SM_ENABLE_LSB)
                    | (0x08 << PIO_CTRL_SM_RESTART_LSB));
}

// Queue a message for transmission on PIO "tx" state machine
void CanFD2040::pio_tx_send(uint32_t *data, uint32_t count) noexcept
{
    pio_tx_reset();
    pio_hw->instr_mem[can2040_offset_tx_got_recessive] = 0xa242; // nop [2]
    for (unsigned int i = 0; i < count; i++)
    {
    	pio_hw->txf[3] = data[i];
    }
    struct pio_sm_hw *sm = &pio_hw->sm[3];
    sm->instr = 0xe001; // set pins, 1
    sm->instr = can2040_offset_tx_start; // jmp tx_start
    sm->instr = 0x20c0; // wait 1 irq, 0
    pio_hw->ctrl = 0x0f << PIO_CTRL_SM_ENABLE_LSB;
}

// Set PIO "tx" state machine to inject an ack after a CRC match
void CanFD2040::pio_tx_inject_ack(uint32_t match_key) noexcept
{
    pio_tx_reset();
    pio_hw->instr_mem[can2040_offset_tx_got_recessive] = 0xc023; // irq wait 3
    pio_hw->txf[3] = 0x7fffffff;
    struct pio_sm_hw *sm = &pio_hw->sm[3];
    sm->instr = 0xe001; // set pins, 1
    sm->instr = can2040_offset_tx_start; // jmp tx_start
    sm->instr = 0x20c2; // wait 1 irq, 2
    pio_hw->ctrl = 0x0f << PIO_CTRL_SM_ENABLE_LSB;

