Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
    pio_match_check(match_key);
}

// Check if the PIO "tx" state machine stopped due to passive/dominant conflict
int CanFD2040::pio_tx_did_conflict() noexcept
{
    return pio_hw->sm[3].addr == can2040_offset_tx_conflict;
}

// Enable host irq on a "may transmit" signal (sm irq 0)
void CanFD2040::pio_irq_set_maytx() noexcept
{
    pio_hw->inte0 = PIO_IRQ0_INTE_SM0_BITS | PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS;
}

// Enable host irq on a "may transmit" or "matched" signal (sm irq 0 or 2)
void CanFD2040::pio_irq_set_maytx_matched() noexcept
{
    pio_hw->inte0 = (PIO_IRQ0_INTE_SM0_BITS | PIO_IRQ0_INTE_SM2_BITS
                     | PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS);
}

// Enable host irq on a "may transmit" or "ack done" signal (sm irq 0 or 3)
void CanFD2040::pio_irq_set_maytx_ackdone() noexcept
{
    pio_hw->inte0 = (PIO_IRQ0_INTE_SM0_BITS | PIO_IRQ0_INTE_SM3_BITS
                     | PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS);
}

// Atomically enable "may transmit" signal (sm irq 0)
void CanFD2040::pio_irq_atomic_set_maytx() noexcept
{
    hw_set_bits(&pio_hw->inte0, PIO_IRQ0_INTE_SM0_BITS);
}

// Disable PIO host irqs (except for normal data read irq)
void CanFD2040::pio_irq_set_none() noexcept
{
    pio_hw->inte0 = PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS;
}

// Setup PIO state machines
void CanFD2040::pio_sm_setup() noexcept
{
    // Reset state machines
    pio_hw->ctrl = PIO_CTRL_SM_RESTART_BITS | PIO_CTRL_CLKDIV_RESTART_BITS;
    pio_hw->fdebug = 0xffffffff;

    // Load pio program
    for (unsigned int i=0; i<ARRAY_SIZE(can2040_program_instructions); i++)
    {
    	pio_hw->instr_mem[i] = can2040_program_instructions[i];
    }

    // Set initial state machine state
    pio_sync_setup();
    pio_rx_setup();
    pio_match_setup();
    pio_tx_setup();

    // Start state machines
    pio_hw->ctrl = 0x07 << PIO_CTRL_SM_ENABLE_LSB;
}

void CanFD2040::pio_setup() noexcept
{
	pio_hw = (regs->pioNumber) ? pio1_hw : pio0_hw;

    // Configure pio0 clock
    const uint32_t rb = (regs->pioNumber) ? RESETS_RESET_PIO1_BITS : RESETS_RESET_PIO0_BITS;
    rp2040_clear_reset(rb);

    // Setup and sync pio state machine clocks
    const uint32_t div = (256 / PIO_CLOCK_PER_BIT) * SystemCoreClockFreq / regs->bitrate;
    for (unsigned int i = 0; i < 4; i++)
    {
    	pio_hw->sm[i].clkdiv = div << PIO_SM0_CLKDIV_FRAC_LSB;
    }

    // Configure state machines
    pio_sm_setup();

    // Map Rx/Tx gpios
	const GpioPinFunction pioFunc = (regs->pioNumber) ? GpioPinFunction::Pio1 : GpioPinFunction::Pio0;
	SetPinFunction(regs->rxPin, pioFunc);
	SetPinFunction(regs->txPin, pioFunc);

    const IRQn_Type irqn = (regs->pioNumber) ? PIO1_IRQ_0_IRQn : PIO0_IRQ_0_IRQn;
	NVIC_DisableIRQ(irqn);
	NVIC_ClearPendingIRQ(irqn);
	NVIC_SetPriority(irqn, 1);
    irq_set_exclusive_handler ((unsigned int)irqn, PIO_isr);
	NVIC_EnableIRQ(irqn);
}

// Report error to calling code (via callback interface)
void CanFD2040::report_callback_error(uint32_t error_code) noexcept
{
    //TODO
}

// Report a received message to calling code (via callback interface)
void CanFD2040::report_callback_rx_msg() noexcept
{
	if (rxFifoNumber < NumCanRxFifos)
	{
		VirtualCanRegisters::RxFifo& fifo = regs->rxFifos[rxFifoNumber];
		unsigned int putPointer = fifo.putIndex;
		CanRxBuffer& rxBuffer = const_cast<CanRxBuffer&>(fifo.buffers[putPointer]);
		rxBuffer.R0.bit.ID = parse_id;
		rxBuffer.R1.bit.DLC = parse_dlc;
		++putPointer;
		if (putPointer == fifo.size)
		{
			putPointer = 0;
		}
		fifo.putIndex = putPointer;
		pendingIrqs |= VirtualCanRegisters::recdFifo0 << rxFifoNumber;
	}
}

// Report a message that was successfully transmitted
void CanFD2040::report_callback_tx_msg() noexcept
{
	regs->cancelTransmission = false;					// in case we were just asked to cancel the transmission that we have just completed
	txStuffedWords = 0;									// this allows the main loop to populate the buffer with a new message
}

// EOF phase complete - report message (rx or tx) to calling code
void CanFD2040::report_handle_eof() noexcept
{
    if (report_state == ReportState::RS_IDLE)
    {
        // Message already reported or an unexpected EOF
        return;
    }
    if (report_state & ReportState::RS_AWAIT_EOF)
    {
        // Successfully processed a new message - report to calling code
        pio_sync_normal_start_signal();
        if (report_state & ReportState::RS_IS_TX)
        {
            report_callback_tx_msg();
        }
        else
        {
            report_callback_rx_msg();
        }
    }
    report_state = ReportState::RS_IDLE;
    pio_match_clear();
}

// Check if in an rx ack is pending
int CanFD2040::report_is_acking_rx() noexcept
{
    return report_state == (ReportState)(ReportState::RS_IN_MSG | ReportState::RS_AWAIT_EOF);
}

// Parser found a new message start
void CanFD2040::report_note_message_start() noexcept
{
    pio_irq_set_maytx();
}

// Setup for ack injection (if receiving) or ack confirmation (if transmit)
void CanFD2040::report_note_crc_start() noexcept
{
	// Get 21 (more is OK) bits of expected data (lower 16 bits of CRC plus 4 fixed stuff bits plus CRC delimiter)
#if 1
	// GCC generates more efficient code for this than for either of the following
	uint32_t expectedData =   ((parse_crc & 0xe000) << 4)
							| ((parse_crc & 0x1e00) << 3)
							| ((parse_crc & 0x01e0) << 2)
							| ((parse_crc & 0x001e) << 1)
							|  (parse_crc & 0x0001);										// insert gaps for stuff bits
	expectedData = (expectedData << 1)														// make room for CRC delimiter
					| ((~expectedData) & ((1u << 17) | (1u << 12) | (1u << 7) | (1u << 2)))	// insert stuff bits
					| 0x0001;																// add CRC delimiter
#elif 1
	uint32_t expectedData = (parse_crc & 0x1e000);											// bits 13-15 of CRC
	expectedData = (expectedData << 1) | (~parse_crc & 0x2000) | (parse_crc & 0x1e00);		// fixed stuff bit (inverse of bit 13) and bits 9-12
	expectedData = (expectedData << 1) | (~parse_crc & 0x0200) | (parse_crc & 0x01e0);		// fixed stuff bit (inverse of bit 9) and bits 5-8
	expectedData = (expectedData << 1) | (~parse_crc & 0x0020) | (parse_crc & 0x001e);		// fixed stuff bit (inverse of bit 5) and bits 1-4
	expectedData = (expectedData << 1) | (~parse_crc & 0x0002) | (parse_crc & 0x0001);		// fixed stuff bit (inverse of bit 1) and bit 0
	expectedData = (expectedData << 1) | 0x0001;
#else
	uint32_t expectedData = (parse_crc & 0x01)						// bit 0 of CRC
						  | (~parse_crc & 0x02)						// fixed stuff bit = inverse of bit 1
						  | ((parse_crc & 0x1e) << 1)				// bits 1-4 of CRC
						  | ((~parse_crc & 0x20) << 1)				// fixed stuff bit = inverse of bit 5
						  | ((parse_crc & 0x1e0) << 2)				// bits 5-8 of CRC
						  | ((~parse_crc & 0x0200) << 2)			// fixed stuff bit = inverse of bit 9
						  | ((parse_crc & 0x1e00) << 3)				// bits 9-12 of CRC
						  | ((~parse_crc & 0x2000) << 3)			// fixed stuff bit = inverse of bit 13
						  | ((parse_crc & 0xe000) << 4);			// bits 13-15 of CRC
	expectedData = (expectedData << 1) | 0x0001;
#endif

    const uint32_t cs = unstuf.GetStuffCount();
    const uint32_t crcstart_bitpos = raw_bit_count - cs - 1;
    const uint32_t crcend_bitpos = crcstart_bitpos + 19;

    if (tx_check_local_message())
    {
        // This is a self transmit - setup tx eof "matched" signal
        report_state = (ReportState)(ReportState::RS_IN_MSG | ReportState::RS_IS_TX);
        pio_match_check(pio_match_calc_key((expectedData << 9) | 0x00ff, crcend_bitpos + 10));
    }
    else if (rxFifoNumber < NumCanRxFifos)
    {
		// Inject ack
		report_state = ReportState::RS_IN_MSG;
		const uint32_t match_key = pio_match_calc_key(expectedData, crcend_bitpos + 1);
	    if (   tx_state == TS_QUEUED
	    	&& !pio_tx_did_conflict()
	        && pio_rx_fifo_level() > 1
		   )
	    {
	        // Rx state is behind - acking wont succeed and may halt active tx
	    	++regs->errors.tooLateToAck;
	    }
	    else
	    {
			tx_state = TS_ACKING_RX;
			pio_tx_inject_ack(match_key);
			pio_irq_set_maytx_ackdone();

