Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
			// Setup for future rx eof "matched" signal
			report_eof_key = pio_match_calc_key((expectedData << 8) | 0x7f, crcend_bitpos + 9);
		}
    }
    else
    {
		// We are not acking this message because it isn't meant for us. Setup for future rx eof "matched" signal, assuming that an ack bit is seen.
		report_eof_key = pio_match_calc_key((expectedData << 8) | 0x7f, crcend_bitpos + 9);
    }
}

// Parser found successful ack
void CanFD2040::report_note_ack_success() noexcept
{
    if (!(report_state & ReportState::RS_IN_MSG))
    {
        // Got rx "ackdone" and "matched" signals already
    }
    else
    {
		report_state = (ReportState)(report_state | ReportState::RS_AWAIT_EOF);
		if (report_state & ReportState::RS_IS_TX)
		{
			// Enable "matched" irq for fast back-to-back transmit scheduling
			pio_irq_set_maytx_matched();
		}
    }
}

// Parser found successful EOF
void CanFD2040::report_note_eof_success() noexcept
{
    report_handle_eof();
}

// Parser found unexpected data on input
void CanFD2040::report_note_parse_error() noexcept
{
    if (report_state != ReportState::RS_IDLE) {
        report_state = ReportState::RS_IDLE;
        pio_match_clear();
    }
    pio_sync_slow_start_signal();
    pio_irq_set_maytx();
}

// Received PIO rx "ackdone" irq
void CanFD2040::report_line_ackdone() noexcept
{
    if (!(report_state & ReportState::RS_IN_MSG))
    {
        // Parser already processed ack and eof bits
        pio_irq_set_maytx();
    }
    else
    {
		// Setup "matched" irq for fast rx callbacks
		report_state = (ReportState)(ReportState::RS_IN_MSG | ReportState::RS_AWAIT_EOF);
		pio_match_check(report_eof_key);
		pio_irq_set_maytx_matched();
		// Schedule next transmit (so it is ready for next frame line arbitration)
		tx_schedule_transmit();
    }
}

// Received PIO "matched" irq
void CanFD2040::report_line_matched() noexcept
{
    // Implement fast rx callback and/or fast back-to-back tx scheduling
    report_handle_eof();
    pio_irq_set_none();
    tx_schedule_transmit();
}

// Received 10+ passive bits on the line (between 10 and 17 bits)
void CanFD2040::report_line_maytx() noexcept
{
    // Line is idle - may be unexpected EOF, missed ack injection,
    // missed "matched" signal, or can2040_transmit() kick.
    report_handle_eof();
    pio_irq_set_none();
    tx_schedule_transmit();
}

// Transition to the next parsing state
void CanFD2040::data_state_go_next(ParseState state, uint32_t bits) noexcept
{
    parse_state = state;
    unstuf.SetCount(bits);
}

// Transition to the MS_DISCARD state - drop all bits until 6 passive bits
void CanFD2040::data_state_go_discard() noexcept
{
    report_note_parse_error();
    unstuf.UseDynamicStuffing();

    if (pio_rx_check_stall())
    {
        // CPU couldn't keep up for some read data - must reset pio state
        raw_bit_count = 0;
        unstuf.ClearStuffCount();
        pio_sm_setup();
        report_callback_error(0);
    }

    data_state_go_next(MS_DISCARD, 32);
}

// Received six dominant bits on the line
void CanFD2040::data_state_line_error() noexcept
{
    data_state_go_discard();
}

// Received six passive bits on the line
void CanFD2040::data_state_line_passive() noexcept
{
    if (parse_state != MS_DISCARD)
    {
        // Bitstuff error
        data_state_go_discard();
    }
    else
    {
    	unstuf.UseDynamicStuffing();
		const uint32_t stuffed_bits = unstuf.GetStuffedBits() >> unstuf.GetStuffCount();
		if (stuffed_bits == 0xffffffff)
		{
			// Counter overflow in "sync" state machine - reset it
			pio_sync_setup();
			unstuf.ClearStuffedBits();
			data_state_go_discard();
		}
		else if (((stuffed_bits + 1) & 0x1ff) == 0)		// look for sof after 9 passive bits (most "PIO sync" will produce)
		{
			data_state_go_next(MS_START, 1);
		}
		else
		{
			data_state_go_discard();
		}
    }
}

// Transition to MS_DATA0 state (if applicable) - await data bits
void CanFD2040::data_state_go_data() noexcept
{
	if (parse_dlc == 0)
    {
        data_state_go_stuff_count();						// no data in packet
    }
	else
	{
		parse_bytesReceived = 0;
		parse_bytesLeft = (parse_dlc <= 8) ? parse_dlc
							: (parse_dlc <= 12) ? (parse_dlc - 6) << 2
								: (parse_dlc - 11) << 4;
		data_state_go_next(MS_DATA, 8 * min<uint32_t>(parse_bytesLeft, 4));
	}
}

// Transition to MS_STUFFCOUNT state
void CanFD2040::data_state_go_stuff_count() noexcept
{
	unstuf.UseFixedStuffing();								// tell the unstuffer that the next bit and then every 4 bits are forced stuff bits
	data_state_go_next(MS_STUFFCOUNT, (parse_dlc > 10) ? 10 : 6);	// receive the 4 stuff count bits + the first 2 or 6 CRC bits (and 2 fixed stuff bits)
}

// Handle reception of first bit of header (after start-of-frame (SOF))
void CanFD2040::data_state_update_start(uint32_t data) noexcept
{
	rxTimeStamp = timer_hw->timerawl;						// save time stamp for later
	data &= 0x01;
    parse_id = data;										// store the first data bit (MSbit of ID)
    report_note_message_start();
    unstuf.UseDynamicStuffing();							// we're already using dynamic stuffing but we need to reset the count of stuff bits
    unstuf.InitCrc(data, 2);								// add the SOF and the first header bit to the CRCs
    data_state_go_next(MS_HEADER, 20);
}

// If there is space in receive fifo 'whichFifo', set rxMessage and FifoNumber accordingly, else leave them alone and flag the overflow
void CanFD2040::SetupToReceive(unsigned int whichFifo, bool extendedId) noexcept
{
	if (whichFifo < NumCanRxFifos)
	{
		VirtualCanRegisters::RxFifo& fifo = regs->rxFifos[whichFifo];
		const uint32_t putIndex = fifo.putIndex;
		uint32_t nextPutIndex = putIndex + 1;
		if (nextPutIndex == fifo.size)
		{
			nextPutIndex = 0;
		}
		if (nextPutIndex != fifo.getIndex)
		{
			CanRxBuffer& rxBuffer = const_cast<CanRxBuffer&>(fifo.buffers[putIndex]);
			rxBuffer.R0.bit.XTD = extendedId;
			rxBuffer.R1.bit.RXTS = rxTimeStamp;
			rxMessage = rxBuffer.data;
			rxFifoNumber = whichFifo;
		}
		else
		{
			++regs->errors.rxFifoOverlow[whichFifo];
		}
	}
}

// Handle reception of next 20 header bits which for CAN-FD frame with short ID takes us up to and including the DLC bits
void CanFD2040::data_state_update_header(uint32_t data) noexcept
{
    data |= parse_id << 20;									// or in the most significant ID bit
    if ((data & 0x0300) == 0x0300)							// if SRR and ID are both set
    {
        // Extended ID
        parse_id = ((data & 0x1ffc00) << 8) | ((data & 0x00ff) << 10);	// this is now the top 19 bits of the ID field
        data_state_go_next(MS_EXT_HEADER, 19);
    }
    else if ((data & 0x3e0) == 0x80)						// if r1 and IDE are both clear, FDF is set, r0 and and BRS are clear
    {
		// Short ID
		parse_id = (data >> 10) & 0x7ff;					// save the complete ID
		parse_dlc = data & 0x0F;

		// See if we are interested in this message
		rxFifoNumber = NumCanRxFifos;						// set an invalid fifo number
		rxMessage = rxDummyMessage;
		for (unsigned int filterNumber = 0; filterNumber < regs->numShortFilterElements; ++filterNumber)
		{
			const CanStandardMessageFilterElement& f = const_cast<const CanStandardMessageFilterElement&>(regs->shortFiltersAddr[filterNumber]);
			if (f.Matches(parse_id))
			{
				SetupToReceive(f.whichBuffer, false);
				break;
			}
		}

		data_state_go_data();
    }
	else
	{
		++regs->errors.wrongMessageType;
		data_state_go_discard();							// not a message format we can parse
	}
}

// Handle reception of additional 19 bits of "extended header" which takes us to the end of the DLC field
void CanFD2040::data_state_update_ext_header(uint32_t data) noexcept
{
	if ((data & 0x1e0) == 0x80)								// if FDF bit is set, and r1, BRS and r0 are not set
	{
		parse_id |= (data >> 9) & 0x03ffff;					// or-in the bottom 18 bits of the ID
		parse_dlc = data & 0x0F;

		// See if we are interested in this message
		rxFifoNumber = NumCanRxFifos;						// set an invalid fifo number
		rxMessage = rxDummyMessage;
		for (unsigned int filterNumber = 0; filterNumber < regs->numExtendedFilterElements; ++filterNumber)
		{
			const CanExtendedMessageFilterElement& f = const_cast<const CanExtendedMessageFilterElement&>(regs->extendedFiltersAddr[filterNumber]);
			if (f.Matches(parse_id))
			{
				SetupToReceive(f.whichBuffer, true);
				break;
			}
		}

		data_state_go_data();
	}
	else
	{
		++regs->errors.wrongMessageType;
		data_state_go_discard();
	}
}

// Handle reception of data content
void CanFD2040::data_state_update_data(uint32_t data) noexcept
{
	if (parse_bytesLeft < 4)
	{
	    rxMessage[parse_bytesReceived/4] = __builtin_bswap32(data << (32 - (8 * parse_bytesLeft)));
	    data_state_go_stuff_count();
	}
	else
	{
		rxMessage[parse_bytesReceived/4] = __builtin_bswap32(data);
		parse_bytesReceived += 4;
		parse_bytesLeft -= 4;
		if (parse_bytesLeft != 0)
		{
			data_state_go_next(MS_DATA, 8 * min<uint32_t>(parse_bytesLeft, 4));
		}
		else
		{
			data_state_go_stuff_count();
		}
	}
}

