Duet3D/CoreN2G/src/RP2040/CanFD2040.cpp
// Handle reception of 4 bits of message stuff count and 2 or 6 bytes of CRC
void CanFD2040::data_state_update_stuffCount(uint32_t data) noexcept
{
	uint32_t stuffCount;
	uint32_t crcBits;
	if (parse_dlc > 10)
	{
		stuffCount = data >> 6;									// get stuff count and parity bit
		unstuf.AddCrcBits(stuffCount, 4);
		parse_crc = unstuf.GetCrc21();							// set up the expected CRC
		crcBits = data & 0x3f;									// get top 6 bits of CRC
	}
	else
	{
		stuffCount = data >> 2;									// get stuff count and parity bit
		unstuf.AddCrcBits(stuffCount, 4);
		parse_crc = unstuf.GetCrc17();							// set up the expected CRC
		crcBits = data & 0x03;									// get top 2 bits of CRC
	}

	// Check stuff count parity (should be even) and stuff count
	if (unlikely((stuffCount & 0x0f) != GrayTable[unstuf.GetTotalStuffBits() & 0x07]))
	{
		// Check whether the parity is wrong so we can report a parity error separately
		uint32_t parity = stuffCount ^ (stuffCount >> 2);
		parity ^= (parity >> 1);
		if (parity & 1u)
		{
			++regs->errors.stuffCountParity;
		}
		else
		{
			++regs->errors.wrongStuffCount;
		}
		data_state_go_discard();
	}
	else if (likely((parse_crc >> 15) == crcBits))
	{
		// Transition to MS_CRC state - await another 15 bits of crc + delimiter
		report_note_crc_start();
		data_state_go_next(MS_CRC, 16);							// read 15 more CRC bits (plus fixed stuffing bits) plus delimiter
	}
	else
	{
		++regs->errors.wrongCrc;
		data_state_go_discard();
	}
}

// Handle reception of 16 bits of message CRC (15 crc bits + crc delimiter)
void CanFD2040::data_state_update_crc(uint32_t data) noexcept
{
	if (likely((((parse_crc & 0x7fff) << 1) | 1u) == (data & 0xffff)))
    {
		unstuf.UseNoStuffing();
		data_state_go_next(MS_ACK, 2);
    }
	else if (data & 0x01)
    {
    	++regs->errors.wrongCrc;
        data_state_go_discard();
    }
	else
	{
		++regs->errors.missingCrcDelimiter;
        data_state_go_discard();
	}
}

// Handle reception of 2 bits of ack phase (ack, ack delimiter)
void CanFD2040::data_state_update_ack(uint32_t data) noexcept
{
	if ((data & 0x01) != 0x01)		//TEMP don't check ACK, just check the delimiter
 //   if (data != 0x01)
    {
		++regs->errors.missingAckDelimiter;
        data_state_go_discard();
    }
	else
	{
		report_note_ack_success();
		data_state_go_next(MS_EOF0, 4);
	}
}

// Handle reception of first four end-of-frame (EOF) bits
void CanFD2040::data_state_update_eof0(uint32_t data) noexcept
{
    if ((data & 0x0f) != 0x0f || pio_rx_check_stall())
    {
    	++regs->errors.missingEofBit1;
        data_state_go_discard();
    }
    else
    {
    	unstuf.ClearState();
    	unstuf.UseDynamicStuffing();
    	data_state_go_next(MS_EOF1, 4);
    }
}

// Handle reception of end-of-frame (EOF) bits 5-7 and first IFS bit
void CanFD2040::data_state_update_eof1(uint32_t data) noexcept
{
    if (data >= 0x0e || (data >= 0x0c && report_is_acking_rx()))
    {
        // Message is considered fully transmitted
        report_note_eof_success();
    }

    if ((data & 0x0f) == 0x0f)
    {
        data_state_go_next(MS_START, 1);
    }
    else
    {
    	++regs->errors.missingEofBit2;
        data_state_go_discard();
    }
}

// Handle data received while in MS_DISCARD state
void CanFD2040::data_state_update_discard(uint32_t data) noexcept
{
    data_state_go_discard();
}

// Update parsing state after reading the bits of the current field
void CanFD2040::data_state_update(uint32_t data) noexcept
{
	switch (parse_state)
	{
	case MS_START:		data_state_update_start(data); break;
	case MS_HEADER:		data_state_update_header(data); break;
	case MS_EXT_HEADER:	data_state_update_ext_header(data); break;
	case MS_DATA:		data_state_update_data(data); break;
	case MS_STUFFCOUNT:	data_state_update_stuffCount(data); break;
	case MS_CRC:		data_state_update_crc(data); break;
	case MS_ACK:		data_state_update_ack(data); break;
	case MS_EOF0:		data_state_update_eof0(data); break;
	case MS_EOF1:		data_state_update_eof1(data); break;
	case MS_DISCARD:	data_state_update_discard(data); break;
	}
}

/****************************************************************
 * Input processing
 ****************************************************************/

// Process an incoming byte of data from PIO "rx" state machine
void CanFD2040::process_rx(uint32_t rx_byte) noexcept
{
	unstuf.AddBits(rx_byte, 8);
    raw_bit_count += 8;

    // undo bit stuffing
    for (;;)
    {
        const int ret = unstuf.PullBits();
        if (likely(ret > 0))
        {
            // Need more data
            break;
        } else if (likely(ret == 0))
        {
            // Pulled the next field - process it
            data_state_update(unstuf.GetUnstuffedBits());
        } else if (ret == -1)
		{
			// 6 consecutive high bits
			data_state_line_passive();
		} else
		{
			// 6 consecutive low bits, or incorrect fixed stuff bit
			++regs->errors.badStuffing;
			data_state_line_error();
		}
    }
}

// Main API irq notification function
void CanFD2040::pio_irq_handler() noexcept
{
    uint32_t ints = pio_hw->ints0;
    while (likely(ints & PIO_IRQ0_INTE_SM1_RXNEMPTY_BITS))
    {
        uint8_t rx_byte = pio_hw->rxf[1];
        process_rx(rx_byte);
        ints = pio_hw->ints0;
        if (likely(!ints))
        {
            return;
        }
    }

    if (ints & PIO_IRQ0_INTE_SM3_BITS)
    {
        // Ack of received message completed successfully
        report_line_ackdone();
    }
    else if (ints & PIO_IRQ0_INTE_SM2_BITS)
    {
        // Transmit message completed successfully
        report_line_matched();
    }
    else if (ints & PIO_IRQ0_INTE_SM0_BITS)
    {
        // Bus is idle, but not all bits may have been flushed yet
        report_line_maytx();
    }
}

/****************************************************************
 * Transmit state tracking
 ****************************************************************/

// Queue the next message for transmission in the PIO
void CanFD2040::tx_schedule_transmit() noexcept
{
    if (tx_state == TS_QUEUED && !pio_tx_did_conflict())
    {
        // Already queued or actively transmitting
    }
    else if (txStuffedWords == 0)
    {
        // No new messages to transmit
        tx_state = TS_IDLE;
    }
    else if (regs->cancelTransmission)
    {
    	txStuffedWords = 0;						// release the buffer so that the main loop can fill it with the next message
    	regs->cancelTransmission = false;
        tx_state = TS_IDLE;
    }
    else
    {
		tx_state = TS_QUEUED;
		pio_tx_send(txMessage, txStuffedWords);
    }
}

// Check if the current parsed message is feedback from current transmit
bool CanFD2040::tx_check_local_message() noexcept
{
    if (tx_state == TS_QUEUED && txStuffedWords != 0 && txCrc == parse_crc && txId == parse_id && txDlc == parse_dlc)		// ideally we would check the data here too
    {
        // Received our own transmission
        tx_state = TS_CONFIRM_TX;
        return true;
    }
    return false;
}

extern VirtualCanRegisters virtualRegs;
static CanFD2040 canFdDevice;

extern "C" [[noreturn]]void Core1Entry() noexcept
{
	canFdDevice.Entry(&virtualRegs);
}

extern "C" void PIO_isr() noexcept
{
	canFdDevice.pio_irq_handler();
}

// End
